Docker/Results/Suricata/Fio/results_1.txt
hostname=5b2bfbe8f540, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5b2bfbe8f540> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5b2bfbe8f540> ...
<5b2bfbe8f540> Starting 4 processes
<5b2bfbe8f540> 
write-test: (groupid=0, jobs=1): err= 0: pid=313: Tue Dec 10 17:32:49 2024
  read: IOPS=11.9k, BW=46.4MiB/s (48.7MB/s)(13.6GiB/300001msec)
    slat (nsec): min=1727, max=1696.6k, avg=3864.32, stdev=2976.77
    clat (nsec): min=866, max=6095.2k, avg=79554.80, stdev=33487.85
     lat (usec): min=11, max=6128, avg=83.42, stdev=34.00
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   79], 80.00th=[   84], 90.00th=[   93], 95.00th=[  112],
     | 99.00th=[  143], 99.50th=[  153], 99.90th=[  273], 99.95th=[  396],
     | 99.99th=[ 2245]
   bw (  KiB/s): min=32944, max=51056, per=25.01%, avg=47519.19, stdev=3270.92, samples=599
   iops        : min= 8236, max=12764, avg=11879.80, stdev=817.73, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=92.70%, 250=7.16%, 500=0.08%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.09%, sys=7.17%, ctx=3567546, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3563739,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=314: Tue Dec 10 17:32:49 2024
  read: IOPS=11.9k, BW=46.4MiB/s (48.6MB/s)(13.6GiB/300001msec)
    slat (nsec): min=1777, max=1531.8k, avg=3899.69, stdev=2929.09
    clat (nsec): min=843, max=6094.2k, avg=79583.28, stdev=33039.38
     lat (usec): min=11, max=6129, avg=83.48, stdev=33.55
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   79], 80.00th=[   84], 90.00th=[   93], 95.00th=[  112],
     | 99.00th=[  143], 99.50th=[  153], 99.90th=[  277], 99.95th=[  404],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=31904, max=50776, per=24.99%, avg=47484.49, stdev=3255.35, samples=599
   iops        : min= 7976, max=12694, avg=11871.12, stdev=813.84, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=92.63%, 250=7.23%, 500=0.08%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.11%, sys=7.21%, ctx=3564995, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3561157,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=315: Tue Dec 10 17:32:49 2024
  read: IOPS=11.9k, BW=46.4MiB/s (48.6MB/s)(13.6GiB/300001msec)
    slat (nsec): min=1728, max=2996.7k, avg=3894.39, stdev=3333.73
    clat (nsec): min=695, max=6068.3k, avg=79569.13, stdev=33611.96
     lat (usec): min=11, max=6102, avg=83.46, stdev=34.15
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   79], 80.00th=[   84], 90.00th=[   93], 95.00th=[  112],
     | 99.00th=[  143], 99.50th=[  153], 99.90th=[  273], 99.95th=[  400],
     | 99.99th=[ 2245]
   bw (  KiB/s): min=32536, max=51208, per=25.00%, avg=47494.46, stdev=3258.67, samples=599
   iops        : min= 8134, max=12802, avg=11873.62, stdev=814.67, samples=599
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=92.65%, 250=7.22%, 500=0.08%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.15%, sys=7.16%, ctx=3565745, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3561926,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=316: Tue Dec 10 17:32:49 2024
  read: IOPS=11.9k, BW=46.4MiB/s (48.6MB/s)(13.6GiB/300001msec)
    slat (nsec): min=1760, max=1725.2k, avg=3867.05, stdev=2907.49
    clat (nsec): min=917, max=6102.4k, avg=79574.25, stdev=33458.21
     lat (usec): min=11, max=6137, avg=83.44, stdev=33.96
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   79], 80.00th=[   84], 90.00th=[   93], 95.00th=[  112],
     | 99.00th=[  143], 99.50th=[  153], 99.90th=[  269], 99.95th=[  396],
     | 99.99th=[ 2245]
   bw (  KiB/s): min=33000, max=50856, per=25.00%, avg=47506.62, stdev=3254.73, samples=599
   iops        : min= 8250, max=12714, avg=11876.65, stdev=813.68, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=92.68%, 250=7.19%, 500=0.08%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.11%, sys=7.15%, ctx=3566571, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3562777,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=186MiB/s (195MB/s), 46.4MiB/s-46.4MiB/s (48.6MB/s-48.7MB/s), io=54.4GiB (58.4GB), run=300001-300001msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:32:49 2024
  read: IOPS=47.5k, BW=186Mi (195M)(54.4GiB/300001msec)
    slat (nsec): min=1727, max=2996.7k, avg=3881.36, stdev=3041.74
    clat (nsec): min=695, max=6102.4k, avg=79570.36, stdev=33400.08
     lat (usec): min=11, max=6137, avg=83.45, stdev=33.92
   bw (  KiB/s): min=130384, max=203896, per=25.00%, avg=190004.75, stdev=3257.88, samples=2396
   iops        : min=32596, max=50974, avg=47501.19, stdev=814.47, samples=2396
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=92.67%, 250=7.20%, 500=0.08%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.12%, sys=7.17%, ctx=14264857, majf=0, minf=54
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14249599,0,0,0 short=0,0,0,0 dropped=0,0,0,0