Docker/Results/Suricata/Fio/results_2.txt
hostname=5b2bfbe8f540, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5b2bfbe8f540> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5b2bfbe8f540> ...
<5b2bfbe8f540> Starting 4 processes
<5b2bfbe8f540> 
write-test: (groupid=0, jobs=1): err= 0: pid=336: Tue Dec 10 17:38:57 2024
  read: IOPS=12.2k, BW=47.7MiB/s (50.0MB/s)(14.0GiB/300001msec)
    slat (nsec): min=1720, max=422042, avg=3332.64, stdev=1858.74
    clat (nsec): min=666, max=6101.9k, avg=77996.78, stdev=27602.61
     lat (usec): min=11, max=6128, avg=81.33, stdev=27.82
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   77], 80.00th=[   81], 90.00th=[   89], 95.00th=[  104],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  225], 99.95th=[  293],
     | 99.99th=[  947]
   bw (  KiB/s): min=39696, max=51624, per=25.01%, avg=48819.78, stdev=1169.76, samples=599
   iops        : min= 9924, max=12906, avg=12204.94, stdev=292.44, samples=599
  lat (nsec)   : 750=0.01%
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=94.36%
  lat (usec)   : 250=5.56%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.83%, sys=6.38%, ctx=3663641, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3660997,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=337: Tue Dec 10 17:38:57 2024
  read: IOPS=12.2k, BW=47.7MiB/s (50.0MB/s)(14.0GiB/300001msec)
    slat (nsec): min=1719, max=582157, avg=3330.64, stdev=1865.32
    clat (nsec): min=894, max=6124.5k, avg=78013.46, stdev=27823.60
     lat (usec): min=11, max=6153, avg=81.34, stdev=28.04
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   77], 80.00th=[   81], 90.00th=[   89], 95.00th=[  105],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  227], 99.95th=[  293],
     | 99.99th=[ 1123]
   bw (  KiB/s): min=39664, max=51704, per=25.00%, avg=48805.65, stdev=1190.84, samples=599
   iops        : min= 9916, max=12926, avg=12201.41, stdev=297.71, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.35%, 250=5.57%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.88%, sys=6.33%, ctx=3662587, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3659941,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=338: Tue Dec 10 17:38:57 2024
  read: IOPS=12.2k, BW=47.6MiB/s (50.0MB/s)(14.0GiB/300001msec)
    slat (nsec): min=1712, max=1196.7k, avg=3337.98, stdev=1971.08
    clat (nsec): min=1888, max=6101.4k, avg=78015.82, stdev=27473.54
     lat (usec): min=11, max=6121, avg=81.35, stdev=27.70
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   77], 80.00th=[   81], 90.00th=[   89], 95.00th=[  105],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  227], 99.95th=[  293],
     | 99.99th=[  873]
   bw (  KiB/s): min=39616, max=51488, per=25.00%, avg=48800.63, stdev=1189.64, samples=599
   iops        : min= 9904, max=12872, avg=12200.15, stdev=297.41, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.30%, 250=5.62%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.83%, sys=6.40%, ctx=3662025, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3659501,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=339: Tue Dec 10 17:38:57 2024
  read: IOPS=12.2k, BW=47.7MiB/s (50.0MB/s)(14.0GiB/300001msec)
    slat (nsec): min=1727, max=511989, avg=3342.74, stdev=1860.47
    clat (nsec): min=756, max=6093.0k, avg=78010.25, stdev=27827.22
     lat (usec): min=11, max=6124, avg=81.35, stdev=28.04
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   64], 10.00th=[   68], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   75], 60.00th=[   76],
     | 70.00th=[   77], 80.00th=[   80], 90.00th=[   89], 95.00th=[  105],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  227], 99.95th=[  293],
     | 99.99th=[ 1106]
   bw (  KiB/s): min=39184, max=51504, per=25.00%, avg=48805.86, stdev=1165.64, samples=599
   iops        : min= 9796, max=12876, avg=12201.46, stdev=291.41, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.31%, 250=5.60%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.85%, sys=6.39%, ctx=3662495, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3659916,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=191MiB/s (200MB/s), 47.6MiB/s-47.7MiB/s (50.0MB/s-50.0MB/s), io=55.8GiB (60.0GB), run=300001-300001msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:38:57 2024
  read: IOPS=48.8k, BW=191Mi (200M)(55.8GiB/300001msec)
    slat (nsec): min=1712, max=1196.7k, avg=3336.00, stdev=1889.50
    clat (nsec): min=666, max=6124.5k, avg=78009.08, stdev=27682.15
     lat (usec): min=11, max=6153, avg=81.35, stdev=27.90
   bw (  KiB/s): min=158160, max=206320, per=25.00%, avg=195231.92, stdev=1178.28, samples=2396
   iops        : min=39540, max=51580, avg=48807.97, stdev=294.57, samples=2396
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.33%, 250=5.59%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.85%, sys=6.38%, ctx=14650748, majf=0, minf=54
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14640355,0,0,0 short=0,0,0,0 dropped=0,0,0,0